app/Controllers/AdminClassSectionController.php

SELECT `section_s`.*, `class_Name`.`class_name_s`
FROM `section_s`
JOIN `class_Name` ON `class_Name`.`class_name_auto_id` = `section_s`.`class_pr_id_set`
---
    public function index()
    {
        $data['sections'] = $this->sectionModel
        ->select('section_s.*, class_Name.class_name_s')
        ->join('class_Name', 'class_Name.class_name_auto_id = section_s.class_pr_id_set')
        ->findAll();

UPDATE `section_s` SET `section_namesss` = 'Alfa2'
WHERE `section_s`.`section_pr_iddds` IN ('6')
---
    public function updateSection()
    {
        $sectionId = $this->request->getPost('id');
        $sectionName = $this->request->getPost('section_name');

        if (empty($sectionId) || empty($sectionName)) {
            return $this->response->setJSON([
                'status' => '400',
                'message' => 'Section ID and section name are required'
            ]);
        }

        // Find the section by ID
        $section = $this->sectionModel->find($sectionId);
        if (!$section) {
            return $this->response->setJSON([
                'status' => '404',
                'message' => 'Section not found'
            ]);
        }

        // Update only the section name
        $data = [
            'section_namesss' => $sectionName
        ];

        $updated = $this->sectionModel->update($sectionId, $data);