app/Controllers/AdminNoticeController.php

    public function index()
    {
        $data['allNotice'] = $this->noticeModel->findAll();
---
SELECT *
FROM `notice`

    public function delete($id){
    // Get the notice to find the image path
        $notice = $this->noticeModel->find($id);

        if ($notice && !empty($notice['featured_image'])) {
            $imagePath = ROOTPATH . $notice['featured_image'];
            if (file_exists($imagePath)) {
                @unlink($imagePath); // Delete the image file
            }
        }

        $this->noticeModel->delete($id);
---
DELETE FROM `notice`
WHERE `id` IN ('2')