app/Controllers/Notice.php

    public function index(){
        $data['allNotice'] = $this->noticeModel->findAll();
---
SELECT *
FROM `notice`

    public function show($id){
        $data['notice'] = $this->noticeModel->find($id);
---
SELECT *
FROM `notice`
WHERE `notice`.`id` = '4'