app/Controllers/StudentSearchController.php

SELECT *
FROM `student_info`
WHERE `class_iddddd` = '1'
---
    public function student_info_in_modal()
    {
        $class_name_auto_id     = $this->request->getPost('class_name_auto_id');
        $data['student_info']   = $this->StudentSearchModel->where('class_iddddd', $class_name_auto_id )->findAll();

SELECT *
FROM `student_info`
WHERE `student_info_sets_at_iddddds` = '1'
 LIMIT 1
---
    public function single_student_info()
    {
        $student_id = $this->request->getPost('student_id');
        $data['single_student_info'] = $this->StudentSearchModel->where('student_info_sets_at_iddddds', $student_id)->first();